Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 48, 48, 1)]       0         
_________________________________________________________________
conv1_1 (Conv2D)             (None, 48, 48, 64)        640       
_________________________________________________________________
batch_normalization (BatchNo (None, 48, 48, 64)        256       
_________________________________________________________________
conv1_2 (Conv2D)             (None, 48, 48, 64)        36928     
_________________________________________________________________
batch_normalization_1 (Batch (None, 48, 48, 64)        256       
_________________________________________________________________
pool1_1 (MaxPooling2D)       (None, 24, 24, 64)        0         
_________________________________________________________________
drop1_1 (Dropout)            (None, 24, 24, 64)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 24, 24, 128)       73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 24, 24, 128)       512       
_________________________________________________________________
conv2_2 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
batch_normalization_3 (Batch (None, 24, 24, 128)       512       
_________________________________________________________________
conv2_3 (Conv2D)             (None, 24, 24, 128)       147584    
_________________________________________________________________
pool2_1 (MaxPooling2D)       (None, 12, 12, 128)       0         
_________________________________________________________________
drop2_1 (Dropout)            (None, 12, 12, 128)       0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 12, 12, 256)       295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 12, 256)       1024      
_________________________________________________________________
conv3_2 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
batch_normalization_6 (Batch (None, 12, 12, 256)       1024      
_________________________________________________________________
conv3_3 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
batch_normalization_7 (Batch (None, 12, 12, 256)       1024      
_________________________________________________________________
conv3_4 (Conv2D)             (None, 12, 12, 256)       590080    
_________________________________________________________________
batch_normalization_8 (Batch (None, 12, 12, 256)       1024      
_________________________________________________________________
pool3_1 (MaxPooling2D)       (None, 6, 6, 256)         0         
_________________________________________________________________
drop3_1 (Dropout)            (None, 6, 6, 256)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 6, 6, 256)         1024      
_________________________________________________________________
conv4_2 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
batch_normalization_10 (Batc (None, 6, 6, 256)         1024      
_________________________________________________________________
conv4_3 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
batch_normalization_11 (Batc (None, 6, 6, 256)         1024      
_________________________________________________________________
conv4_4 (Conv2D)             (None, 6, 6, 256)         590080    
_________________________________________________________________
batch_normalization_12 (Batc (None, 6, 6, 256)         1024      
_________________________________________________________________
pool4_1 (MaxPooling2D)       (None, 3, 3, 256)         0         
_________________________________________________________________
drop4_1 (Dropout)            (None, 3, 3, 256)         0         
_________________________________________________________________
conv5_1 (Conv2D)             (None, 3, 3, 512)         1180160   
_________________________________________________________________
batch_normalization_13 (Batc (None, 3, 3, 512)         2048      
_________________________________________________________________
conv5_2 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
batch_normalization_14 (Batc (None, 3, 3, 512)         2048      
_________________________________________________________________
conv5_3 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
batch_normalization_15 (Batc (None, 3, 3, 512)         2048      
_________________________________________________________________
conv5_4 (Conv2D)             (None, 3, 3, 512)         2359808   
_________________________________________________________________
pool5_1 (MaxPooling2D)       (None, 1, 1, 512)         0         
_________________________________________________________________
drop5_1 (Dropout)            (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
output (Dense)               (None, 7)                 3591      
=================================================================
Total params: 13,111,367
Trainable params: 13,103,431
Non-trainable params: 7,936
_________________________________________________________________
